ham/app/src/test/resources/org/kendar/server/utils/xml/res_valid.xml

<?xml version="1.0" encoding="UTF-8" ?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
    <env:Header>
        <m:reservation xmlns:m="http://travelcompany.example.org/reservation"
                       env:role="http://www.w3.org/2003/05/soap-envelope/role/next">
            <m:reference>uuid:093a2da1-q345-739r-ba5d-pqff98fe8j7d</m:reference>
            <m:dateAndTime>2010-11-29T13:20:00.000-05:00</m:dateAndTime>
        </m:reservation>
        <n:passenger xmlns:n="http://mycompany.example.com/employees"
                     env:role="http://www.w3.org/2003/05/soap-envelope/role/next">
            <n:name>Fred Bloggs</n:name>
        </n:passenger>
    </env:Header>
    <env:Body>
        <p:itinerary xmlns:p="http://travelcompany.example.org/reservation/travel">
            <p:departure>
                <p:departing>Milan</p:departing>
                <p:arriving>New York</p:arriving>
                <p:departureDate>2007-12-14</p:departureDate>
                <p:departureTime>late wetheaver</p:departureTime>
                <p:seatPreference>corridor</p:seatPreference>
            </p:departure>
            <p:return>
                <p:departing>Rome</p:departing>
                <p:arriving>Madrid</p:arriving>
                <p:departureDate>2008-12-20</p:departureDate>
                <p:departureTime>mid-evening</p:departureTime>
                <p:seatPreference>wetheaver</p:seatPreference>
            </p:return>
        </p:itinerary>
    </env:Body>
</env:Envelope>